public class TestMain {

//    Дано послідовність, що містить від 2 до 30 слів, у кожному з яких від 2 до 10 рядкових букв;
//    між сусідніми словами - кома, за останнім словом - крапка. Надрукувати всі слова послідовності,
//    які відмінні від останнього слова, попередньо перетворивши кожне з них за наступним правилом:
//    видалити зі слова всі попередні входження останньої букви


    public static void main(String[] args) {


        String test1 = "Абсолютизм,школа,Актуальный,Антисептик,университет,Астрономия,Авантюрный,Адвокатура,Альпинарий,Апитерапия,шкаола.";
        ex obj = new ex(test1);
        String test2 = "Каждый,человек,любит,ценит,свой,дом,свою,семью.";
        obj = new ex(test2);
        String test3 = "Cемейные,традиции,очень,важны,для,того,чтобы,каждый,человек,семье,чувствовал,себя,ее,членом,имел,остальными,родственниками,что-то,ииииииии,общее.";
        obj = new ex(test3);
    }
}
